Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: It recognizes a set of format units similar to the ones recognized by :cfunc:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
pl: Rozpoznaje ono zestaw jednostek formatu podobnych do tych rozpoznawanych przez :cfunc:`PyArg_ParseTuple`, ale parametry (które są wprowadzane do funkcji, nie są wynikami) nie mogą być wskaźnikami, tylko wartościami. Zwracają nowy przedmiot języka pytonowskiego, dostosowany do zwracania z zadania C wzywanego przez język pytonowski.

source: One difference with :cfunc:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :cfunc:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
pl: Jedna różnicą w zadaniu :cfunc:`PyArg_ParseTuple`: podczas gdy ta druga wymaga jej pierwszego parametru aby był krotką (od kiedy listy parametrów języka pytonowskiego są zawsze reprezentowane jeko krotki wewnętrznie), :cfunc:`Py_BuildValue` nie zawsze buduje krotkę. Buduje krotkę tylko jeśli jej ciąg formatujący zawiera dwie lub więcej jednostki formatujące. Jeśli ciąg formatujący jest pusty, zwraca ``Żaden`` - z ang. - ``None``; jeśli zawiera dokładnie jedną jednostkę formatującą, zwraca ten przedmiot który jest opisywany przez tą jednostkę formatującą. Aby zmusić ją aby zwracała krotkę o rozmiarze 0 lub jeden, zawrzyj ciąg formatujący w nawiasy.

source: Examples (to the left the call, to the right the resulting Python value)::
pl: Przykłady (na lewo - wywołanie, na prawo - wynikająca wartość języka pytonowskiego)::

source: Reference Counts
pl: Liczby odniesień

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :cfunc:`malloc` and :cfunc:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
pl: W językach takich jak C lub C++, programujący jest odpowiedzialny za dynamiczną alokację i dealokację pamięci na stercie. W C, to jest dokonywane przy użyciu zadań :cfunc:`malloc` i :cfunc:`free`. W C++, operatory ``new`` i ``delete`` są używane z w gruncie rzeczy jednakowym znaczeniem i ograniczymy się w następującej dyskusji do przypadku C.

source: Every block of memory allocated with :cfunc:`malloc` should eventually be returned to the pool of available memory by exactly one call to :cfunc:`free`. It is important to call :cfunc:`free` at the right time. If a block's address is forgotten but :cfunc:`free` is not called for it, the memory it occupies cannot be reused until the program terminates. This is called a :dfn:`memory leak`. On the other hand, if a program calls :cfunc:`free` for a block and then continues to use the block, it creates a conflict with re-use of the block through another :cfunc:`malloc` call. This is called :dfn:`using freed memory`. It has the same bad consequences as referencing uninitialized data --- core dumps, wrong results, mysterious crashes.
pl: Każdy blok pamięci alokowany za pomocą zadania :cfunc:`malloc` powinien w końcu być zwrócony do puli dostępnej pamięci przez dokładnie jedno odwołanie do zadania :cfunc:`free`. Jest to istotne aby wywołać zadanie :cfunc:`free` we właściwym momencie. Jeśli adres bloku został zapomniany, ale zadanie :cfunc:`free` nie zostanie wezwane dla niego, pamięć którą zajmuje nie może być ponownie użyta dopóki program nie zakończy swojego działania. To nazywane jest wyciekiem pamięci - z ang. - :dfn:`memory leak`. Z drugiej strony, jeśli program wywołuje :cfunc:`free` dla bloku i potem nadal korzysta z bloku, tworzy to konflikt z ponownym użyciem bloku przez inne wywołanie zadania :cfunc:`malloc`. To jest zwane :dfn:`użyciem uwolnionej pamięci` - z ang. - :dfn:`using freed memory`. Ma to tak samo złe konsekwencje jak odwołanie się do niezainicjowanych danych --- zrzuty jądra, złe wyniki, tajemnicze zatrzymania programu.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
pl: Typowymi przyczynami wycieków pamięci są nietypowe ścieżki przejścia przez kod. Dla przykładu, zadanie może zaalokować blok pamięci, wykonać pewne obliczenia, a potem uwolnić ten blok jeszcze raz. Teraz zmiana w wymaganiach dla zadania może dodać test do obliczenia który wykrywa warunek błędu i może wrócić wcześniej z zadania. Łatwo jest zapomnieć aby uwolnić zaalokowany blok pamięci podczas wybierania tej drogi wcześniejszego zakończenia, szczególnie gdy jest dodawane później do kodu. Takie przecieki, gdy raz wprowadzone, często uchodzą niewykryte przez długi czas: błędne wyjście jest wybierane tylko w małym wycinku wszystkich wywołań, i większość nowoczesnych maszyn ma mnóstwo wirtualnej pamięci, tak że wyciek staje się widoczny tylko w długo działającym procesie który używa cieknącego zadania często. Dlatego też, jest to ważne aby zapobiegać wyciekom przed ich nastąpieniem, przez powzięcie konwencji kodowania lub strategii która minimalizuje ten rodzaj błędu.

source: Since Python makes heavy use of :cfunc:`malloc` and :cfunc:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
pl: Skoro język pytonowski często używa :cfunc:`malloc` i :cfunc:`free`, wymagana jest strategia aby omijać wycieki pamięci zarówno jak też użycia uwolnionej pamięci. Wybrana metoda jest zwana :dfn:`zliczaniem odniesień` - z ang. :dfn:`reference counting`. Zasada jest prosta: każdy przedmiot zawiera licznik, który jest zwiększany gdy odniesienie do przedmiotu jest zachowywane gdzieś, i który jest zmniejszany gdy odniesienie do niego jest kasowane. Gdy licznik dotrze do zera, ostatnie odniesienie do przedmiotu zostało skasowane i przedmiot jest uwalniany.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :cfunc:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :cfunc:`malloc` and :cfunc:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
pl: Alternatywna strategia jest zwana :dfn:`automatyczną zbiórką śmieci`. (Czasami, do zliczania odniesień także odnosimy się jako do strategii zbierania śmieci, stąd moje użycie określenia "automatycznej" aby odróżnić je między sobą.) Dużą zaletą automatycznej zbiórki śmieci jest to, że użytkownik nie musi wzywać zadania :cfunc:`free` jawnie. (Inną utrzymywaną zaletą jest usprawnienie w prędkości użycia pamięci --- nie jest to jednak twardy fakt.) Wadą jest to że dla C nie ma prawdziwie przenośnego automatycznego zbieracza śmieci, podczas gdy zliczanie odniesień może być wypełnione przenośnie (tak długo, jak dostępne są zadania :cfunc:`malloc` i :cfunc:`free` --- co gwarantuje standard C). Może pewnego dnia wystarczająco przenośny automatyczny zbieracz śmieci będzie dostępny dla C. Jednak do tego czasu, będziemy musieli żyć ze zliczaniem odniesień.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
pl: Podczas gdy język pytonowski używa tradycyjnego wypełnienia zliczania odniesień, on także oferuje wykrywanie cykli, które pracuje aby wykrywać cykliczne odniesienia. To pozwala aplikacjom nie martwić się o tworzenie bezpośrednich lub pośrednich cyklicznych odniesień; to są słabości wypełnienia zbiórki śmieci opartego jedynie na zliczaniu odniesień. Cykle odniesień składają się z przedmiotów które zawierają (możliwie pośrednio) odniesienia do samych siebie, tak że każdy przedmiot w cyklu ma liczbę odniesień która jest nie-zerowa. Typowe wypełnienia zliczające odniesienia nie są w stanie przejąć z powrotem pamięci należącej do któregokolwiek z przedmiotów w cyklu odniesień, ani do której odnosi się któryś z przedmiotów w cyklu, nawet jeśli nie ma więcej odniesień do cyklu samego w sobie.

source: The cycle detector is able to detect garbage cycles and can reclaim them so long as there are no finalizers implemented in Python (:meth:`__del__` methods). When there are such finalizers, the detector exposes the cycles through the :mod:`gc` module (specifically, the ``garbage`` variable in that module). The :mod:`gc` module also exposes a way to run the detector (the :func:`collect` function), as well as configuration interfaces and the ability to disable the detector at runtime. The cycle detector is considered an optional component; though it is included by default, it can be disabled at build time using the :option:`--without-cycle-gc` option to the :program:`configure` script on Unix platforms (including Mac OS X). If the cycle detector is disabled in this way, the :mod:`gc` module will not be available.
pl: Wykrywacz cyklów jest w stanie wykryć cykle śmieci i przejąć je tak długo jak nie ma sposobów postępowania zakańczających życie przedmiotów wypełnionych w języku pytonowskim (sposobów postępowania :meth:`__del__`). Gdy są takie sposoby postępowania zakańczające życie przedmiotów, wykrywacz cyklów wystawia cykle przez moduł :mod:`gc` (szczególnie, przez zmienną ``śmieci`` w tym module). Moduł :mod:`gc` także wystawia sposób aby uruchomić wykrywacz cykli (zadaniem :func:`collect`), zarówno, jak też sprzęgi i możliwość wyłączenia wykrywacza w czasie wykonania programów. Wykrywacz cykli jest uznawany za dodatkowy (ponadprogramowy) element; chociaż jest załączony domyślnie, może być wyłączony w czasie budowania przy użyciu opcji :option:`--without-cycle-gc` dla skryptu :program:`configure` na maszynie/środowisku Unix-owym (włączając w to Mac OS X). Jeśli wykrywacz cykli zostanie wyłączony w ten sposób, moduł :mod:`gc` nie będzie dostępny.

source: Reference Counting in Python
pl: Zliczanie odniesień w języku pytonowskim

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :cfunc:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :cfunc:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
pl: Istnieją dwa makropolecenia, ``Py_INCREF(x)`` i ``Py_DECREF(x)``, które obsługują zwiększanie i zmniejszanie liczby odniesień. :cfunc:`Py_DECREF` uwalnia także przedmiot gdy liczba odniesień dotrze do zera. Dla elastyczności, nie wzywa się zadania :cfunc:`free` bezpośrednio --- zamiast tego, wykonuje się wywołanie zadania przez wskaźnik zadania, w :dfn:`typie przedmiotu` - z ang. :dfn:`type object` należącym do przedmiotu. Dla tego celu (i innych), każdy przedmiot także zawiera wskaźnik do swojego rodzaju przedmiotu.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :cfunc:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :cfunc:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
pl: Wielkie pytanie teraz pozostaje: kiedy używać ``Py_INCREF(x)`` i ``Py_DECREF(x)``? Wprowadźmy najpierw kilka terminów. Nikt nie "posiada" przedmiotu; jednakże można :dfn:`posiadać odniesienie` do przedmiotu. Liczba odniesień do przedmiotu jest teraz określona jako liczba posiadanych odniesień do niego. Właściciel odniesienia jest odpowiedzialny za wezwanie zadania :cfunc:`Py_DECREF` gdy odniesienie nie jest już dłużej potrzebne. Bycie właścicielem odniesienia może być przenoszone. Istnieją trzy sposoby aby pozbyć się posiadanego odniesienia: przekazać je, zachować je lub wywołać zadanie :cfunc:`Py_DECREF`. Zapominanie o pozbyciu się posiadanego odniesienia tworzy wyciek pamięci.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :cfunc:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely. [#]_
pl: Jest także możliwe :dfn:`pożyczanie` [#]_ - z ang. - :dfn:`borrow` [#]_ odniesienia do przedmiotu. Pożyczający odniesienie nie powinien wzywać :cfunc:`Py_DECREF`. Pożyczającemu nie wolno trzymać się przedmiotu dłużej niż właścicielowi od którego przedmiot został pożyczony. Używanie pożyczonego odniesienia po tym jak właściciel się go pozbył ryzykuje używaniem uwolnionej pamięci i powinno być unikane całkowicie. [#]_

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
pl: Zaletą pożyczania ponad posiadaniem odniesienia jest to że nie potrzebujesz zaprzątać swojej uwagi pozbyciem się odniesienia na wszystkich możliwych ścieżkach przejścia przez kod --- innymi słowy, z pożyczonym odniesieniem nie musisz ryzykować wycieku gdy nastąpi przedwczesne wyjście z programu. Wadą pożyczania ponad posiadaniem jest to że istnieją pewne szczególne sytuacje gdzie w wydawałoby się poprawnym kodzie pożyczone odniesienie może być użyte po tym jak właściciel od którego zostało ono pożyczone faktycznie pozbył się go.

source: A borrowed reference can be changed into an owned reference by calling :cfunc:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
pl: Pożyczone odniesienie może być zamienione na posiadane odniesienie przez wezwanie :cfunc:`Py_INCREF`. To nie wpływa na status właściciela od którego odniesienie zostało pożyczone --- to tworzy nowe posiadane odniesienie, i daje pełne prawa i obowiązki właścicielskie (nowy właściciel musi pozbyć się odniesienia we właściwy sposób, tak jak poprzedni właściciel).

source: Ownership Rules
pl: Zasady właścicielskie

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
pl: Zawsze gdy odniesienie do przedmiotu jest przekazywane do lub z zadania, jest częścią specyfiki sprzęgu zadania to czy własność jest przekazywana z odniesieniem czy też nie.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :cfunc:`PyLong_FromLong` and :cfunc:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :cfunc:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
pl: Większość zadań które zwracają odniesienie do przedmiotu przekazuje prawo własności wraz z odniesieniem. W szczególności, wszystkie zadania których celem jest tworzenie nowych przedmiotów, takich jak :cfunc:`PyLong_FromLong` i :cfunc:`Py_BuildValue`, przekazują prawo własności do odbierającego. Nawet jeśli przedmiot nie jest właściwie nowy, wciąż otrzymujesz własność nowego odniesienia do tego przedmiotu. Dla przykładu, :cfunc:`PyLong_FromLong` utrzymuje pamięć podręczną popularnych wartości i może zwrócić odniesienie do przedmiotów trzymanych w pamięci podręcznej.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :cfunc:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :cfunc:`PyTuple_GetItem`, :cfunc:`PyList_GetItem`, :cfunc:`PyDict_GetItem`, and :cfunc:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
pl: Wiele zadań które wydobywają przedmioty z innych przedmiotów także przekazuje własność z odniesieniem, na przykład :cfunc:`PyObject_GetAttrString`. Obraz jest mniej jasny, tutaj, jednakże, gdyż kilka typowych zadań jest wyjątkami: :cfunc:`PyTuple_GetItem`, :cfunc:`PyList_GetItem`, :cfunc:`PyDict_GetItem`, i :cfunc:`PyDict_GetItemString` wszystkie zwracają odniesienia które pożyczasz z krotki, listy lub słownika.

source: The function :cfunc:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
pl: Zadanie :cfunc:`PyImport_AddModule` także zwraca pożyczone odniesienia, nawet jeśli może to właściwie tworzyć przedmiot który zwraca: jest to możliwe, ponieważ posiadane odniesienie do przedmiotu jest przechowywane w ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :cfunc:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :cfunc:`PyTuple_SetItem` and :cfunc:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :cfunc:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
pl: Gdy przekazujesz odniesienie do przedmiotu dla innego zadania, z reguły, zadanie pożycza odniesienie od ciebie --- jeśli potrzebuje zachować je, użyje :cfunc:`Py_INCREF` aby zostać niezależnym właścicielem. Istnieją dokładnie dwa istotne wyjątki od tej reguły: zadania :cfunc:`PyTuple_SetItem` i :cfunc:`PyList_SetItem`. Te zadania przejmują prawo własności przedmiotów przekazywanych im --- nawet jeśli zawiodą! (Zauważ, że :cfunc:`PyDict_SetItem i jego przyjaciele nie przejmują własności --- one są "normalne.")

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :cfunc:`Py_INCREF`.
pl: Gdy zadanie C jest wzywane z poziomu języka pytonowskiego, pożycza ono odniesienia do swoich parametrów od wzywającego. Wywołujący posiada odniesienia do przedmiotu, tak więc istnienie pożyczonych odniesień jest gwarantowane aż do powrotu z zadania. Tylko gdy tak pożyczone odniesienie musi być zachowane lub przekazane, musi ono być zamienione w posiadane odniesienie przez wywołanie makropolecenia :cfunc:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
pl: Odniesienie do przedmiotu zwrócone z zadania C które jest wywołane z poziomu języka pytonowskiego musi być posiadanym odniesieniem --- prawo własności jest przekazywane z zadania do wywołującego to ostatnie.

source: Thin Ice
pl: Cienki lód

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
pl: Istnieje kilka sytuacji gdzie wydawałoby się nieszkodliwe użycie pożyczonych odniesień może prowadzić do kłopotów. Wszystkie one mają do czynienia z niejawnymi wezwaniami programu interpretującego polecenia języka pytonowskiego, które mogą powodować że właściciel odniesienia pozbędzie się go.

source: The first and most important case to know about is using :cfunc:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
pl: Pierwszym i najbardziej istotnym przypadkiem o którym warto wiedzieć jest użycie :cfunc:`Py_DECREF` na niezwiązanym przedmiocie podczas pożyczania odniesienia do elementu listy. Na przykład::

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); /* BUG! */ }
pl: void bug(PyObject *list) { PyObject *element = PyList_GetItem(list, 0); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(element, stdout, 0); /* BŁĄD! */ }
